{
  "cards": [
    {
      "id": 0,
      "name": "Sigismund III Vasa",
      "titles": [
        "King of Poland",
        "Grand Duke of Lithuania",
        "King of Sweden"
      ],
      "time": "1566-1632",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Bacciarelli_-_Zygmunt_III.jpeg/220px-Bacciarelli_-_Zygmunt_III.jpeg"
    },
    {
      "id": 1,
      "name": "Władysław IV Vasa",
      "titles": [
        "King of Poland",
        "Grand Duke of Lithuania",
        "Tsar of All Russia"
      ],
      "time": "1595-1648",
      "image": "https://upload.wikimedia.org/wikipedia/commons/7/72/Rubens_Władysław_Vasa.jpg"
    },
    {
      "id": 2,
      "name": "Augustus II the Strong",
      "titles": [
        "Elector of Saxony",
        "King of Poland",
        "Grand Duke of Lithuania"
      ],
      "time": "1670-1733",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/A%C5%ADgust_Mocny._%D0%90%D1%9E%D0%B3%D1%83%D1%81%D1%82_%D0%9C%D0%BE%D1%86%D0%BD%D1%8B_%28H._Rodakowski%2C_XIX%29.jpg/800px-A%C5%ADgust_Mocny._%D0%90%D1%9E%D0%B3%D1%83%D1%81%D1%82_%D0%9C%D0%BE%D1%86%D0%BD%D1%8B_%28H._Rodakowski%2C_XIX%29.jpg"
    },
    {
      "id" : 3,
      "name": "John II Casimir Vasa",
      "titles" : [
        "King of Poland",
        "Grand Duke of Lithuania"
      ],
      "time" : "1648-1668",
      "image": "https://upload.wikimedia.org/wikipedia/commons/5/59/Bacciarelli_-_Jan_Kazimierz.jpeg"
    },
    {
      "id" : 4,
      "name": "Michael Wisniowiecki",
      "titles" : [
        "King of Poland",
        "Grand Duke of Lithuania"
      ],
      "time" : "1669-1673",
      "image": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Micha%C5%82_Karybut_Vi%C5%A1niaviecki._%D0%9C%D1%96%D1%85%D0%B0%D0%BB_%D0%9A%D0%B0%D1%80%D1%8B%D0%B1%D1%83%D1%82_%D0%92%D1%96%D1%88%D0%BD%D1%8F%D0%B2%D0%B5%D1%86%D0%BA%D1%96.jpg"
    },
    {
      "id" :5,
      "name" : "Augustus III",
      "titles" : [
        "King of Poland",
        "Grand Duke of Lithuania",
        "Elector of Saxony"
      ],
      "time" : "1734-1763",
      "image": "https://upload.wikimedia.org/wikipedia/commons/b/b6/August_III_the_Saxon.PNG"
    },
    {
      "id" : 6,
      "name": "Stanislaw II Augustus Poniatowski",
      "titles" :[
        "King of Poland",
        "Grand Duke of Lithuania"
      ],
      "time" : "1764-1795",
      "image" : "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Vigee_Stanislaw_Augustus.jpg/220px-Vigee_Stanislaw_Augustus.jpg"
    },
    {
      "id" : 7,
      "name" : "Friedrich I",
      "titles" : [
        "King in Prussia",
        "Duke of Prussia"
      ],
      "time" : "1701–1713",
      "image" : "https://upload.wikimedia.org/wikipedia/commons/a/aa/Weidemann%2C_Friedrich_I_Preußen.jpg"
    },
    {
      "id" :8,
      "name" : "Friedrich Wilhelm I",
      "titles" : [
        "King in Prussia",
        "Elector of Brandenburg"
      ],
      "time" : "1713–1740",
      "image" : "https://upload.wikimedia.org/wikipedia/commons/f/f5/Friedrich_Wilhelm_I_1713.jpg"
    },
    {
      "id": 9,
      "name" : "Friedrich II, der Grosse",
      "titles" : [
        "King of Prussia",
        "Elector of Brandenburg"
      ],
      "time": "1740–1786",
      "image": "https://upload.wikimedia.org/wikipedia/commons/9/90/Friedrich_Zweite_Alt.jpg"
    },
    {
      "id": 10,
      "name": "Friedrich Wilhelm II",
      "titles" : [
        "King of Prussia",
        "Elector of Brandenburg"
      ],
      "time" : "1786–1797",
      "image" : "https://upload.wikimedia.org/wikipedia/commons/f/f0/Frederick_Wilhelm_II.png"
    },
    {
      "id" : 11,
      "name" : "Hugues Capet",
      "titles" : [
        "King of the Franks"
      ],
      "time": "987–996",
      "image": "https://upload.wikimedia.org/wikipedia/commons/e/e6/HugoKapet_kronika.jpg"
    },
    {
      "id": 12,
      "name" : "Robert II, le Pieux",
      "titles" : [
        "King of the Franks"
      ],
      "time": "996–1031",
      "image": "http://www.france-pittoresque.com/IMG/jpg/Robert-Pieux-2.jpg"
    },
    {
      "id" :13,
      "name": "Henri I",
      "titles" : [
        "King of the Franks"
      ],
      "time" : "1031–1060",
      "image" :"https://upload.wikimedia.org/wikipedia/commons/f/fe/Henry1_head.jpg"
    },
    {
      "id": 14,
      "name" : "Philip I of France",
      "titles" : [
        "King of the Franks"
      ],
      "time" : "1059–1108",
      "image" : "https://s3-us-west-2.amazonaws.com/find-a-grave-prod/photos/2011/56/53676134_129873752075.jpg"
    },
    {
      "id" : 15,
      "name" :"Louis VI, le Gros",
      "titles" : [
        "King of the Franks"
      ],
      "time" : "1108–1137",
      "image" : "https://s-media-cache-ak0.pinimg.com/originals/47/65/d2/4765d2b4868c8a764c03dbbf55c76269.gif"
    },
    {
      "id" :16,
      "name" : "Louis VII, le Jeune",
      "titles" : [
        "King of the Franks"
      ],
      "time" : "1137–1180",
      "image" : "https://s-media-cache-ak0.pinimg.com/originals/47/1b/b1/471bb12eeb90079b51956bae21f620db.jpg"
    }
  ],
  "detailed":[
    {
      "id" : 0,
      "desc" : "Sigismund III Vasa, Polish Zygmunt Waza, Swedish Sigismund Vasa (born June 20, 1566, Gripsholm, Swed.—died April 30, 1632, Warsaw, Pol.), king of Poland (1587–1632) and of Sweden (1592–99) who sought to effect a permanent union of Poland and Sweden but instead created hostile relations and wars between the two states lasting until 1660.The elder son of King John III Vasa of Sweden and Catherine, daughter of Sigismund I the Old of Poland, Sigismund belonged to the Vasa dynasty through his father and to the Jagiellon dynasty through his mother, who brought him up as a Catholic. He was elected king of Poland in August 1587, succeeding his uncle King Stephen Báthory. To obtain the throne he had to accept a reduction of royal power and a consequent increase of the power of the Sejm (Diet). In 1592 he married the Austrian archduchess Anna, and, after his father’s death the same year, he received the Sejm’s permission to accept the Swedish throne. He was crowned king of Sweden in 1594, but only after promising to uphold Swedish Lutheranism.Leaving his paternal uncle Charles (later Charles IX) as regent in Sweden, Sigismund returned to Poland in July 1594. Charles, however, rose in rebellion, and, when Sigismund returned to Sweden with an army, Charles defeated him at Stångebro (1598) and deposed him in 1599. Sigismund’s subsequent foreign policy was aimed at regaining the Swedish throne, and from 1600 Poland and Sweden were involved in an intermittent war. He also attempted to maintain an alliance with the Austrian Habsburgs. When his first Austrian wife died (1598) and he married her sister Constantia (1605), he provoked his opponents, already aroused by his efforts to introduce majority rule in place of unanimity in the Sejm, to engage in a civil war (1606–08).Shortly after his victory over his internal enemies, Sigismund took advantage of a period of civil unrest in Muscovy (known as the Time of Troubles) and invaded Russia, holding Moscow for two years (1610–12) and Smolensk thereafter. In 1617 the Polish-Swedish conflict, which had been interrupted by an armistice in 1611, broke out again. While Sigismund’s army was also fighting Ottoman forces in Moldavia (1617–21), King Gustavus II Adolphus of Sweden (Charles IX’s son) invaded Sigismund’s lands, capturing Riga (1621) and seizing almost all of Polish Livonia. Sigismund, who concluded the Truce of Altmark with Sweden in 1629, never regained the Swedish crown. His Swedish wars resulted, moreover, in Poland’s loss of Livonia and in a diminution of the kingdom’s international prestige.",
      "images" : [
        "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Zygmunt_III_w_stroju_koronacyjnym.jpg/220px-Zygmunt_III_w_stroju_koronacyjnym.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/9/94/Troschel_Sigismund_III_Vasa.jpg",
        "https://s-media-cache-ak0.pinimg.com/736x/a3/16/43/a31643699be048dcfe72101b49b6dcb8--state-art-portrait-paintings.jpg",
        "http://prabook.com/web/show-photo.jpg?id=1454384",
        "https://s-media-cache-ak0.pinimg.com/236x/3c/c9/3e/3cc93ef69c4c24c865f964fea11ab9c2--th-november-holiday-places.jpg"
      ]

    },
    {
      "id": 1,
      "desc" : "Władysław IV Vasa, (born June 9, 1595, Kraków, Pol.—died May 20, 1648, Merecz), king of Poland (1632–48), a popular monarch who did much to heal the wounds and solve the problems created by his father, Sigismund III Vasa, an obstinate man and religious bigot who created internal friction in Poland and pursued a series of profitless wars abroad. Władysław sought to make Poland secure during a period of change in northern Europe and Russia.When Władysław was 15, his father manipulated the youth’s election as tsar of Russia while Polish forces held Moscow during the Time of Troubles following the death of Boris Godunov. His election, which never resulted in his assumption of the Muscovite throne, was part of an unsuccessful plan by Sigismund to conquer all of Russia and convert the population to Catholicism. As a young man Władysław showed ability as a military leader in operations against Muscovy (1617–18) and the Ottoman Empire (1621).He succeeded to the Polish throne on his father’s death in 1632. In an attempt to take advantage of confusion expected after the death of the Polish king, a Muscovite army of 40,000 crossed Poland’s eastern frontier and laid siege to Smolensk (ceded to Poland by Russia in 1618). Władysław broke the siege in March 1633 and then launched an offensive, capturing the Russian commander in February 1634. By the Peace of Polyanov that followed, Tsar Michael Romanov confirmed all earlier cessions of territory to Poland and agreed to pay 200,000 rubles in exchange for Władysław’s renunciation of all claims to the tsardom.Władysław then moved his army south and forced the Turks to come to terms with him. By agreement Poland and the Ottomans retained their respective control over the Cossacks and the Tatars, and the two countries shared joint suzerainty over Moldavia and Walachia.Władysław won an advantageous peace from Sweden in the Armistice of Stuhmsdorf in September 1635, following a war undertaken to exploit Sweden’s difficulties during the Thirty Years’ War. He failed, however, to find any method for regaining the Swedish crown, which had been held and then lost by his father. He suffered continuing difficulties caused by the efforts of the Polish Sejm (Diet) to check the King’s power and limit his dynastic ambitions. In 1637 Władysław married Cecilia Renata of Austria, sister of the Holy Roman emperor Ferdinand III. When she bore him a son, Sigismund Casimir, in 1640, Władysław once more tried to assert his personal power. His attempts to mediate between the warring German and Scandinavian powers came to nothing, and he finally planned to use the Cossacks to provoke the Turks into attacking Poland so that his military leadership would be indispensable. The plan, however, failed before it got underway. Brokenhearted at the death of his son in 1647, Władysław died at the moment when the Cossacks, angered because his promises had failed to materialize, were beginning their greatest revolt against Polish rule.",
      "images" : [
        "https://upload.wikimedia.org/wikipedia/commons/6/61/Claesz_Soutman_Władysław_IV_Vasa.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/a/a1/Władysław_IV_Vasa.jpg",
        "https://s-media-cache-ak0.pinimg.com/originals/33/3d/0f/333d0f971922cbaeef9383abda0fcbe0.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Prince_Władysław_Sigismund_-_detail.jpg/210px-Prince_Władysław_Sigismund_-_detail.jpg"
      ]
    },
    {
      "id": 2,
      "desc": "Augustus II, also called Augustus Frederick, byname Augustus the Strong, Polish August II Wettin or August Mocny, German August Friedrich or August der Starke (born May 12, 1670, Dresden, Saxony [Germany]—died February 1, 1733, Warsaw, Poland), king of Poland and elector of Saxony (as Frederick Augustus I). Though he regained Poland’s former provinces of Podolia and the Ukraine, his reign marked the beginning of Poland’s decline as a European power.The second son of Elector John George III of Saxony, Augustus succeeded his elder brother John George IV as elector in 1694. After the death of John III Sobieski of Poland (1696), Augustus became one of 18 candidates for the Polish throne. To further his chances, he converted to Catholicism, thereby alienating his Lutheran Saxon subjects and causing his wife, a Hohenzollern princess, to leave him. Shortly after his coronation (1697) the “Turkish War,” which had begun in 1683 and in which he had participated intermittently since 1695, was concluded; by the Treaty of Carlowitz in 1699, Poland received Podolia, with Kamieniec (Kamenets) and the Ukraine west of the Dnieper River from the Ottoman Empire.Seeking to conquer the former Polish province of Livonia, then in Swedish hands, for his own Saxon house of Wettin, Augustus formed an alliance with Russia and Denmark against Sweden. Although the Polish Diet refused to support him, he invaded Livonia in 1700, thus beginning the Great Northern War (1700–21), which ruined Poland economically. In July 1702 Augustus’s forces were driven back and defeated by King Charles XII of Sweden at Kliszów, northeast of Kraków. Deposed by one of the Polish factions in July 1704, he fled to Saxony, which the Swedes invaded in 1706. Charles XII forced Augustus to sign the Treaty of Altranstädt (September 1706), formally abdicating and recognizing Sweden’s candidate, Stanisław Leszczyński, as king of Poland (see Altranstädt, treaties of). In 1709, after Russia defeated Sweden at the Battle of Poltava, Augustus declared the treaty void and, supported by Tsar Peter I the Great, again became king of Poland.When Russia intervened (1716–17) in an internal dispute between Augustus and dissident Polish nobles (Confederation of Tarnogród) and, in 1720, annexed Livonia, the king saw the danger of Russia’s growing influence in Polish affairs. He tried unsuccessfully to create a hereditary Polish monarchy transmissible to his one legitimate son, Frederick Augustus II (eventually king of Poland as Augustus III), and to secure other lands for his many illegitimate children. But his hopes of establishing a strong monarchy came to naught. By the end of his reign, Poland had lost its status as a major European power, and when he died the War of the Polish Succession broke out. A man of extravagant and luxurious tastes, he did much to develop Saxon industry and trade and greatly embellished the city of Dresden.",
      "images" : [
        "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/August_II_the_Strong_by_Marcello_Bacciarelli.PNG/160px-August_II_the_Strong_by_Marcello_Bacciarelli.PNG",
        "https://static.artuk.org/w800h800/CDNII/CDNII_BRIM_Painting_2.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Ernst_August_II._%28Sachsen-Weimar-Eisenach%29%40Schloss_Tiefurt.JPG/220px-Ernst_August_II._%28Sachsen-Weimar-Eisenach%29%40Schloss_Tiefurt.JPG",
        "https://medias.expertissim.com/media/cache/media_zoom/uploads/object/2015/06/29/12250349/2318x2318_562e56fc7e1cb.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Aŭgust_Mocny._Аўгуст_Моцны_%28H._Rodakowski%2C_XIX%29.jpg/220px-Aŭgust_Mocny._Аўгуст_Моцны_%28H._Rodakowski%2C_XIX%29.jpg"
      ]
    },
    {
      "id" : 3,
      "desc" : "John II Casimir Vasa, Polish Jan Kazimierz Waza (born March 22, 1609, Kraków, Pol.—died Dec. 16, 1672, Nevers, France), king of Poland (1648–68) and pretender to the Swedish throne, whose reign was marked by heavy losses of Polish territory incurred in wars against the Ukrainians, Tatars, Swedes, and Russians. The second son of Sigismund III Vasa, king of Poland and of Sweden, John Casimir fought on the Habsburg side against France during the Thirty Years’ War from 1635 until, on his way to Spain to assume the office of admiral, he was arrested by the French and imprisoned for two years (1638–40). After his release he decided to forgo military life and became a Jesuit novice (1646), but he resigned his position a year later. A few months after the death of his brother King Władysław IV in May 1648, John Casimir was elected to the Polish throne and soon married Marie Louise de Gonzague-Nevers, his brother’s widow. John Casimir tried to end an insurrection of Poland’s semiautonomous Ukrainian Cossack subjects by negotiation but was forced to continue the war by Polish nobles who wished to increase their control over Ukraine. He defeated the Cossacks and their Tatar allies at Beresteczko June 28–30, 1651, but the fighting began anew when the Cossacks submitted themselves to the Russian tsar in return for military aid. While the Polish army was fighting on the eastern border of Poland, the Swedish army invaded from the west and occupied most of the country by October 1655. John Casimir fled abroad but returned in 1656 when Polish peasants and gentry rebelled against Swedish control. At the conclusion of the war with Sweden in 1660, he had to renounce his rights to the Swedish throne and to northern Livonia. In January 1667 Poland signed the Truce of Andrusovo with Russia, whereby half of Belorussia (with Smolensk), Chernigov (modern Chernihiv, Ukraine), and all of Ukraine east of the Dnieper River, as well as Kiev, west of the river, were ceded to Russia. Disgusted with external warfare, facing a rebellion by the Diet, and in mourning after the death of his wife, the king abdicated (Sept. 16, 1668) and retired to France, where he served as titular abbot of Saint-Germain-des-Prés until his death in 1672.",
      "images": [
        "https://upload.wikimedia.org/wikipedia/commons/5/59/Bacciarelli_-_Jan_Kazimierz.jpeg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Kr%C3%B3lewicz_Jan_Kazimierz.jpg/170px-Kr%C3%B3lewicz_Jan_Kazimierz.jpg",
        "http://l7.alamy.com/zooms/b0650730a44c4555a9e0a7d6f2478df3/john-ii-casimir-2131609-16121672-king-of-poland-november-1648-1691668-b2jwn4.jpg",
        "http://geneall.net/images/names/pes_3808.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/9/90/Schultz_John_II_Casimir_Vasa.jpg"
      ]
    },
    {
      "id" :4,
      "desc": "Michael Wiśniowiecki, Polish in full MichaŁ Korybut Wiśniowiecki (born July 31, 1640, Lwów, Pol.—died Nov. 10, 1673, Lwów), king of Poland (1669–73), whose reign was marked by struggles between the pro-Habsburg and pro-French political factions.A native Pole and descendant of Korybut, brother of King Władysław II Jagiełło, Michael was freely elected by the unanimous vote of the Polish nobility; but he was chosen chiefly for the merit of his father, Jérémi Wiśniowiecki, a great border magnate who had victoriously kept down the Cossacks, and he proved to be a passive tool in the hands of the Habsburgs. In view of this, the French party rallied round Jan Sobieski, a military commander of rising fame. The dissensions between the two camps cost Poland a new defeat at the hands of the united Turks and Cossacks. Sealed by the Treaty of Buczacz (Buchach; 1672), by which all Polish Ukraine came under Turkish suzerainty, this defeat was wiped out only by a brilliant victory of Sobieski’s at Khotin (1673), which also, after King Michael’s early death, carried him to the throne (as John III Sobieski) against an Austrian candidate.",
      "images" : [
        "https://faculty.history.wisc.edu/sommerville/351/351images/korybut.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Bacciarelli_-_Micha%C5%82.jpeg/180px-Bacciarelli_-_Micha%C5%82.jpeg",
        "http://www.angelfire.com/mi4/polcrt/images/MWisniowiecki.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/3/3c/King_Michael_Korybut_of_Poland.jpg",
        "https://s-media-cache-ak0.pinimg.com/236x/4a/46/d9/4a46d9c944e3328aacf3374e8aa54761--poland.jpg"
      ]
    },
    {
      "id": 5,
      "desc": "Augustus III, also called Augustus Frederick, Polish August III Wettin, German August Friedrich (born Oct. 17, 1696, Dresden, Saxony [Germany]—died Oct. 5, 1763, Dresden), king of Poland and elector of Saxony (as Frederick Augustus II), whose reign witnessed one of the greatest periods of disorder within Poland. More interested in ease and pleasure than in affairs of state, this notable patron of the arts left the administration of Saxony and Poland to his chief adviser, Heinrich von Brühl, who in turn left Polish administration chiefly to the powerful Czartoryski family.The only legitimate son of Frederick Augustus I of Saxony (Augustus II of Poland), he followed his father’s example by joining the Roman Catholic Church in 1712. In 1719 he married Maria Josepha, daughter of the Holy Roman emperor Joseph I. He became elector of Saxony on his father’s death (1733). As a candidate for the Polish crown, he secured the support of the emperor Charles VI by assenting to the Pragmatic Sanction of 1713, designed to preserve the integrity of the Habsburg inheritance, and that of the Russian empress Anna by supporting Russia’s claim to Courland. Chosen king by a small minority of electors on Oct. 5, 1733, he drove his rival, the former Polish king Stanisław I Leszczyński, into exile. He was crowned in Kraków on Jan. 17, 1734, and was generally recognized as king in Warsaw in June 1736. Augustus gave Saxon support to Austria against Prussia in the War of the Austrian Succession (1742) and again in the Seven Years’ War (1756). His last years were marked by the increasing influence of the Czartoryski and Poniatowski families, and by the intervention of Catherine the Great of Russia in Polish affairs. His rule deepened the anarchization of Poland and increased the country’s dependence on its neighbours.",
      "images" : [
        "https://upload.wikimedia.org/wikipedia/commons/4/4e/Louis_de_Silvestre_-_Portrait_of_Augustus_III_of_Poland_(after_1733)_-_Google_Art_Project.jpg",
        "https://1.bp.blogspot.com/_pzICWg_Xk24/R02bWIiwczI/AAAAAAAAAXw/GB5vI6P9kT0/s400/449px-Largilliere-Auguste_keurvorst_von_saksen_1715.jpg",
        "https://media1.britannica.com/eb-media/95/13295-004-C6C270A9.jpg",
        "https://uploads4.wikiart.org/images/jan-matejko/augustus-iii-of-poland.jpg",
        "http://gameo.org/images/thumb/1/1a/ME1_189.jpg/300px-ME1_189.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/b/bc/Silvestre_Augustus_III_in_Polish_costume.jpg"
      ]
    },
    {
      "id": 6,
      "desc" : "Stanisław II August Poniatowski, original name StanisŁaw Poniatowski (born Jan. 17, 1732, Wołczyn, Pol.—died Feb. 12, 1798, St. Petersburg, Russia), last king of an independent Poland (1764–95). He was unable to act effectively while Russia, Austria, and Prussia dismembered his nation. He was born the sixth child of Stanisław Poniatowski, a Polish noble, and his wife, Princess Konstancja Czartoryska. After a careful education he traveled in western Europe as a young man. In 1757 he was sent by his mother’s enormously powerful family to St. Petersburg to obtain Russian support for their plan to dethrone the Polish king Augustus III. While at the Russian court, he apparently did little for the family’s interests but succeeded in becoming the lover of the future empress, Catherine II. Poland at this time was in a period of steady decline, and, following the death of Augustus III in 1763, Catherine sought to ensure that the situation continued. Seeing the young Poniatowski as a convenient pawn, she used Russian troops and Russian influence to ensure his election as Stanisław II on Sept. 7, 1764. After coming to the throne Stanisław sought to bolster his royal power, improve the administration of government, and strengthen the parliamentary system. These reforms were opposed by some Polish nobles and by Catherine, who threatened to have him deposed. The reforms were dropped, and Catherine then interfered in Poland even further by pressing for full rights for non-Catholic religious dissenters. A revolt by Roman Catholics followed in 1768 and was not fully suppressed for four years. Its effect was to make Stanisław even more dependent on Russian support. In 1772 Russia, Prussia, and Austria each annexed portions of Polish territory, despite Stanisław’s appeals to the Western powers. In the years following this partition, Stanisław saw his own personal power cut away and limited by the manipulations of the partitioning powers. Fighting back, he succeeded in strengthening his position and achieved a full reform of Polish education. A more basic requirement to prevent further national decay was constitutional reform; after long and arduous debate, the Sejm (Diet) finally approved a new constitution on May 3, 1791. To oppose this constitution, the Confederation of Targowica was formed by a group of Polish nobles with Russian backing. In a subsequent invasion by Russia, despite valiant efforts by a small Polish army, the Russians succeeded in crushing the movement for a new constitution.",
      "images" : [
        "https://upload.wikimedia.org/wikipedia/commons/9/99/August_Poniatowski.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Werner_Stanislaus_Augustus_in_coronation_robes.jpg/240px-Werner_Stanislaus_Augustus_in_coronation_robes.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Stanislas_Auguste_Poniatowski.jpg/440px-Stanislas_Auguste_Poniatowski.jpg",
        "http://geneall.net/images/names/pes_989657.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/5/5f/Stanislas_II_August_Poniatowski.PNG"
      ]
    },
    {
      "id" : 7,
      "desc" : "Frederick I, (born July 11, 1657, Königsberg, Prussia [now Kaliningrad, Russia]—died Feb. 25, 1713, Berlin), elector of Brandenburg (as Frederick III), who became the first king in Prussia (1701–13), freed his domains from imperial suzerainty, and continued the policy of territorial aggrandizement begun by his father, Frederick William, the Great Elector. In 1688 Frederick succeeded to the electorate and at once set out, assisted by the capable Eberhard von Danckelmann, his boyhood tutor, now prime minister, on the course that was to yield him a monarch’s crown 13 years later. Frederick maintained a large, splendid court and an army out of proportion to his territories and position to further his pretensions. In European politics, he allied himself with Austria and the sea powers (England and Holland) against France. Prussian troops were sent to the Netherlands (1688) to protect William of Orange’s continental lands against expected French attacks when William crossed the Channel to accept the English crown. By this act Frederick hoped to gain the Dutch stadholdership for himself or his descendants, but he was eventually frustrated. Although, in the wars of the Grand Alliance against Louis XIV (1689–97), Prussia’s contingents in the imperial army distinguished themselves everywhere, Prussia emerged practically unrewarded at the Treaty of Rijswijk (1697). On Nov. 16, 1700, however, Austria and Prussia signed a secret treaty that permitted Frederick to crown himself king in Prussia, thus finally realizing his long-cherished ambition. Austria agreed to this elevation primarily to gain Prussian aid in the threatening war against France over the succession to the Spanish throne. In return, Frederick promised to send 8,000 troops beyond the normal Prussian contingent to the imperial army, to give preference to Habsburg candidates in imperial elections, and to vote with Austria on all important matters in the German Diet as far as Prussian interests permitted. Thus, when Frederick crowned himself in Königsberg on Jan. 18, 1701, Prussia was saddled with weighty obligations. Only his son, Frederick William I, and his grandson, Frederick II the Great, were able to exploit Prussia’s enhanced position to the full and transform the new kingdom into a great European power. During the War of the Spanish Succession (1701–14), Frederick remained a loyal ally to Austria, and Prussia’s military contribution proved outstanding; but again, at the Treaty of Utrecht (1713), Frederick’s territorial rewards were small, consisting of the Swiss canton of Neuchâtel and a few enclaves on the lower Rhine.",
      "images" : [
        "https://upload.wikimedia.org/wikipedia/commons/5/50/Frederick_I_of_Prussia_%28cropped%29.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/f/f2/Antoine_Pesne%3B_Frederik_I_von_Preußen.jpg",
        "http://www.rheinsberger-see.de/Friedrich%20I%20PB.jpg",
        "http://www.barockgemaelde.de/friedrich_I_gesicht.JPG"
      ]
    },
    {
      "id" : 8,
      "desc" : "Frederick William I, German Friedrich Wilhelm I (born August 14, 1688, Berlin—died May 31, 1740, Potsdam, Prussia), second Prussian king, who transformed his country from a second-rate power into the efficient and prosperous state that his son and successor, Frederick II the Great, made a major military power on the Continent. The son of the elector Frederick III, later Frederick I, king of Prussia, Frederick William grew up at a glamorous court, but his own temperament was ascetic, and he disapproved of the court’s dissolute atmosphere. In 1706 he married Sophia Dorothea, the daughter of George Louis, elector of Hanover (later George I of England). His experiences in the War of the Spanish Succession (1701–14) decisively shaped his future, leading him to realize that the army was his vocation. Leopold I, prince of Anhalt-Dessau, who commanded the Prussian contingent in that war, became his lifelong friend and principal adviser in military matters.Frederick William was to spend the rest of his life building the Prussian army into Europe’s best fighting instrument. Realizing that Prussia’s military and financial weakness made it dependent on the relations between the great powers, Frederick William resolved to make his state financially independent.In 1713 Prussia’s armed forces numbered 38,000 soldiers, supported in large part by foreign subsidies. When Frederick William died in 1740, he left his son an army of about 83,000 out of a population of 2,200,000, a war chest of more than 8,000,000 taler, and a Prussia that had become the third military power on the European continent, after Russia and France.The canton system of recruitment and replacement, introduced in 1733, provided one-half the manpower of Frederick William’s army from the Prussian peasantry. The rest of the soldiers were recruited from all over Europe. Frederick William also created from his fractious nobility the loyal Prussian officer corps. Prince Leopold I of Anhalt-Dessau, a brutal, if efficient, drillmaster, provided the instrument wielded by these officers—the Prussian infantry, which could outmarch and outshoot all others.The need for funds, coupled with Frederick William’s genuine concern for his subjects, led to a number of sweeping reforms and innovations. A thrifty, practical Protestant, the king on his accession all but dissolved his extravagant court. Prussia’s eastern territories, depopulated by the plague of 1709, were resettled and made prosperous once again. The lot of the peasantry improved. In his own domains, which eventually comprised one-third of all the land, Frederick William freed the serfs completely (1719) and abolished hereditary leases. In 1717 a yearly tax replaced the aristocracy’s feudal war service. Against considerable opposition, he levied additional taxes in Prussia and Lithuania. Prussia’s commercial policies were strictly mercantilist, encouraging industry and manufacture, especially the wool industry, which clothed the king’s army. Convinced that an efficient state could not afford illiterate subjects, Frederick William instituted compulsory primary education in 1717. In 1723 he centralized his administration under a general directory through which his ministers executed his orders. Near the end of his reign, he initiated a program of extensive legal codification. Thus, Frederick William left his heir an efficient, centralized state with sound finances and an excellent army.",
      "images" : [
        "https://upload.wikimedia.org/wikipedia/commons/e/e7/Antoine_Pesne_-_König_Friedrich_Wilhelm_I._von_Preußen_%28ca._1733%29.jpg",
        "http://www.preussenchronik.de/bilder/433_Friedrich_Wilhelm_I__von_Preussen.jpeg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Friedrich_Wilhelm_I_um_1701.jpg/220px-Friedrich_Wilhelm_I_um_1701.jpg",
        "https://www.preussen.de/Bilder/Geschichte/friedrich_wilhelm_I./friedrich_wilhelm_I_LDM.jpg",
        "http://www.artnet.com/WebServices/images/ll00134lldQS9GFgVeECfDrCWvaHBOc9BFE/georg-wenzeslaus-von-knobelsdorff-portrait-of-king-friedrich-wilhelm-i-of-prussia.jpg"
      ]
    },
    {
      "id" : 9,
      "desc" : "Frederick II, byname Frederick the Great, German Friedrich der Grosse (born January 24, 1712, Berlin, Prussia [Germany]—died August 17, 1786, Potsdam, near Berlin), king of Prussia (1740–86), a brilliant military campaigner who, in a series of diplomatic stratagems and wars against Austria and other powers, greatly enlarged Prussia’s territories and made Prussia the foremost military power in Europe. An enlightened absolute monarch, he favoured French language and art and built a French Rococo palace, Sanssouci, near Berlin. Frederick, the third king of Prussia, ranks among the two or three dominant figures in the history of modern Germany. Under his leadership Prussia became one of the great states of Europe. Its territories were greatly increased and its military strength displayed to striking effect. From early in his reign Frederick achieved a high reputation as a military commander, and the Prussian army rapidly became a model admired and imitated in many other states. He also emerged quickly as a leading exponent of the ideas of enlightened government, which were then becoming influential throughout much of Europe; indeed, his example did much to spread and strengthen those ideas. Notably, his insistence on the primacy of state over personal or dynastic interests and his religious toleration widely affected the dominant intellectual currents of the age. Even more than his younger contemporaries, Catherine II the Great of Russia and Joseph II in the Habsburg territories, it was Frederick who, during the mid-18th century, established in the minds of educated Europeans a notion of what “enlightened despotism” should be. His actual achievements, however, were sometimes less than they appeared on the surface; indeed, his inevitable reliance on the landowning officer (Junker) class set severe limits in several respects to what he could even attempt. Nevertheless, his reign saw a revolutionary change in the importance and prestige of Prussia, which was to have profound implications for much of the subsequent history of Europe.",
      "images" : [
        "https://media1.britannica.com/eb-media/18/19018-004-7B3F97EB.jpg",
        "https://s-media-cache-ak0.pinimg.com/originals/59/12/49/591249fe15694af8879559d8f4c08ff6.jpg",
        "https://s-media-cache-ak0.pinimg.com/736x/58/b9/ca/58b9cac76318cc14e790f3fa15f839b4--frederick-the-great-king-of-prussia.jpg",
        "https://s-media-cache-ak0.pinimg.com/236x/50/46/ef/5046efe2caee6697a9d461560e310285--frederick-the-great-il-grande.jpg",
        "https://s-media-cache-ak0.pinimg.com/236x/b3/67/21/b36721fd011443c0f8965cc559bdb374.jpg"
      ]
    },
    {
      "id" : 10,
      "desc" : "Frederick William II, (born September 25, 1744, Berlin, Prussia [now in Germany]—died November 16, 1797, Berlin), king of Prussia from August 17, 1786, under whom, despite his lack of exceptional military and political gifts, Prussia achieved considerable expansion. The son of Frederick the Great’s brother Augustus William, he became heir presumptive on his father’s death in 1758. He was intellectually receptive and devoted to the arts, but when he succeeded Frederick the Great as king, he was unable to perpetuate his uncle’s system of personal government; the direction of the Prussian state fell to a few favourites. Nevertheless, Prussia grew: it acquired Ansbach and Bayreuth when the margrave Charles Alexander renounced his territories (1791), and it gained Danzig (Gdańsk), Thorn (Toruń), and a large part of central Poland (including Warsaw) in the Second (1793) and Third (1795) Partitions of that country. In foreign affairs Frederick William cooperated with the Holy Roman emperor Leopold II and entered into an Austro-Prussian alliance (February 7, 1792), chiefly because of a common opposition to the French Revolution. In the War of the First Coalition, Frederick William’s preoccupation with getting his share of Poland led him to conduct the war halfheartedly, and in 1795 he withdrew from the coalition by concluding the separate Treaty of Basel. In domestic affairs the king gained easy popularity by abolishing the state monopoly on coffee and tobacco, although the loss of revenue had to be made good by increasing the excise duty on beer, flour, and sugar. Frederick William’s most notorious domestic measure was the Religionsedikt (“Religious Edict”) of 1788, largely the work of his favourite, Johann Christoph von Wöllner. It gave legal recognition to the principle of toleration while restricting the freedom of religious instruction and binding the clergy to a narrow Protestantism. Although it was zealously enforced (Immanuel Kant was reprimanded and several important journals moved abroad to avoid censorship), the act proved ineffective. A notable law code (Allgemeines Preussisches Landrecht) including various liberal statutes, however, was promulgated (1794). Under Frederick William cultural activities flourished, mostly in Berlin. Painting, architecture, and the theatre were encouraged, and especially music: Mozart and Beethoven visited the King and dedicated chamber music to him, and Frederick William himself played the cello. He contracted two dynastic marriages, the first of which was dissolved. During the lifetime of both his royal consorts he also contracted two morganatic marriages. His son by the second of these wives, Sophia Juliana, Gräfin Dönhoff, was the future statesman Friedrich Wilhelm, Graf von Brandenburg.",
      "images" : [
        "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Friedrich_Wilhelm_II._%28Reclam%29.jpg/1200px-Friedrich_Wilhelm_II._%28Reclam%29.jpg",
        "https://68.media.tumblr.com/tumblr_m4fmikgiHL1r7jedvo1_500.jpg",
        "http://www.gemeinde-michendorf.de/homepage/35heimatgeschichte/menschen/adel/1786_friedrich_wilhelm_II.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/2/28/Friedrich_Wilhelm_II.%2C_König_von_Preußen_%28Graff_Kopie%29.jpg"
      ]
    },
    {
      "id": 11,
      "desc": "Hugh Capet, French Hugues Capet (born 938—died October 14, 996, Paris, France), king of France from 987 to 996, and the first of a direct line of 14 Capetian kings of that country. The Capetian dynasty derived its name from his nickname (Latin capa, “cape”). Hugh was the eldest son of Hugh the Great, duke of the Franks. On his father’s death in 956, Hugh Capet inherited vast estates in the regions of Paris and Orléans, extending in some places south of the Loire River. He thus became one of the most powerful vassals in the kingdom and a serious danger to the Carolingian king, Lothar. Hugh married Adelaide, daughter of William III, duke of Aquitaine, in 970, but his efforts to extend his influence into that southwestern kingdom were unsuccessful. From 978 to 986 Hugh was allied with the German emperors Otto II and Otto III and with Adalbero, archbishop of Reims, in political intrigues against the Carolingian king. By 985 Hugh was actually the ruler in all but title; and, after the brief reign of Lothar’s son, Louis V (986–987), Hugh was elected king of France in May 987 by the assembly of Frankish magnates. Adalbero was able to convince the magnates that the crown was elective rather than hereditary and that Charles of Lorraine, the only legitimate Carolingian contender, was unfit to rule. Hugh was crowned at Noyon on July 5, 987. Scholars are generally agreed that Hugh’s election was not a revolutionary action. His grandfather Robert I, his great-uncle Eudes, and his uncle Rudolf (Raoul) had all earlier been non-Carolingian kings.Hugh’s reign was marked by the unavailing efforts of Charles of Lorraine (imprisoned 991) to assert himself and by continual conflict between Eudes I, count of Blois, and Fulk Nerra of Anjou, whom Hugh later supported. In 993 Eudes was aided by the bishop of Laon in an unsuccessful conspiracy to deliver Hugh and his son Robert over to Otto III. That no one was punished for the incident indicated the weakness of the new Capetian dynasty. Hugh’s crown was probably preserved by the inability of his enemies to coordinate their activities against him. The Capetian dynasty’s subsequent rule for more than 300 years has invested Hugh Capet’s reign with a greater significance than his actual achievements merit. Very soon after ascending the throne, Hugh Capet arranged the coronation (December 987) of his own son, Robert, who upon Hugh’s death succeeded to the throne without difficulty. This practice of crowning the heir during the father’s lifetime was continued by the Capetians until the time of Louis VII and undoubtedly contributed to the dynasty’s stability and longevity.",
      "images": [
        "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Hugues_Ier_Capet.jpg/220px-Hugues_Ier_Capet.jpg",
        "https://download.vikidia.org/vikidia/fr/images/thumb/f/f0/Hugues_capet.jpg/200px-Hugues_capet.jpg",
        "http://p6.storage.canalblog.com/69/37/151720/8102355.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/SceauHuguesCapet.PNG/180px-SceauHuguesCapet.PNG"
      ]
    },
    {
      "id": 12,
      "desc": "Robert II, byname Robert The Pious, French Robert Le Pieux (born c. 970, Orléans, Fr.—died July 20, 1031, Melun), king of France who took Burgundy into the French realm. The son of Hugh Capet, founder of the Capetian dynasty, and Adelaide of Aquitaine, Robert was educated at the episcopal school of Reims under Gerbert of Aurillac, later Pope Sylvester II. Soon after his own coronation (July 987), Hugh prudently arranged the election and coronation (December 987) of Robert, thus facilitating his son’s eventual succession (October 996) as sole ruler. His excommunication as a result of his marriage within the prohibited degrees of relationship was eventually lifted after the repudiation of the childless Bertha in 1001. Constance of Arles, whom the King married two years later, was the mother of his successor, Henry I. Robert’s domain was not extensive; and, to increase his power, he vigorously and tenaciously pressed his claim to fiefs as they became vacant. Thus, when the duke of Burgundy died without an heir (1002), Robert went to war against a rival claimant. Only in 1015, however, did he finally succeed in subduing the rich duchy. (The gain was transitory, for in 1032 Henry I granted Burgundy to his brother, Robert, and it thereafter remained for centuries outside royal control.) A patron of the Cluniac monastic movement, Robert apparently ruled firmly and judiciously in his own lands.",
      "iamges": [
        "http://photos.geni.com/p5/2710/0355/53444836787ecad5/250px-Robert_II_of_France_large.jpg",
        "https://s-media-cache-ak0.pinimg.com/originals/07/e8/ee/07e8ee3650042b2efaa5f3c27cd656d3.jpg",
        "https://s-media-cache-ak0.pinimg.com/originals/b0/a3/3e/b0a33e44c4a078e2e18852f62d0d1fc3.jpg",
        "https://s-media-cache-ak0.pinimg.com/236x/d1/32/da/d132dacb4f8d0e3ecf0e6dfca56b88dd--normandy-adele.jpg"
      ]
    },
    {
      "id" : 13,
      "desc": "Henry I, (born c. 1008—died Aug. 2 or 4, 1060, Vitry-aux-Loges, France), king of France from 1026 to 1060 whose reign was marked by struggles against rebellious vassals. The son of Robert II the Pious and grandson of Hugh Capet, founder of the Capetian dynasty, Henry was anointed king at Reims (1026) in his father’s lifetime, following the death of his elder brother Hugh. His mother, Constance, however, favoured his younger brother Robert for the throne, and civil war broke out on King Robert II’s death (1031). The younger Robert was given Burgundy in 1032, after Henry had sought refuge with Robert, Duke of Normandy. From 1033 to 1043 Henry struggled with his feudatories, notably Eudes of Blois and his brother Robert. In 1055, as the result of an agreement made by Robert II, the county of Sens came to the crown as the sole territorial gain of Henry’s reign. He attempted to strengthen his rulership through new court officials, and he twice contracted an important marriage alliance with members of the Salian dynasty, rulers of the Holy Roman Empire: he was betrothed to Conrad II’s niece, who died before the marriage could be formalized, and married Henry III’s daughter. Henry helped William (the future William I of England), Robert’s successor as duke of Normandy, to quell his rebellious vassals at the Battle of Val-aux-Dunes (or Val-ès-Dunes; 1047), but he was thereafter usually at war with him—a notable defeat for the king being that at Varaville (1058). Henry tried to resist papal interference but could not prevent Pope Leo IX from holding a council at Reims (1049). Philip, elder son of Henry’s marriage to Anne of Kiev, was crowned in 1059.",
      "images": [
        "https://www.wikitree.com/photo.php/e/eb/Henri_I.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/f/fe/Henry1_head.jpg"
      ]
    },
    {
      "id" : 14,
      "desc" : "Philip I, (born 1052—died July 29/30, 1108, Melun, France), king of France (1059–1108) who came to the throne at a time when the Capetian monarchy was extremely weak but who succeeded in enlarging the royal estates and treasury by a policy of devious alliances, the sale of his neutrality in the quarrels of powerful vassals, and the practice of simony on a huge scale. Philip was the elder son of Henry I of France by his second wife, Anne of Kiev. Crowned at Reims in May 1059, he became sole king on his father’s death in 1060; Baldwin V, count of Flanders, exercised the regency. Two years after he came of age in 1066, he obtained the county of Gâtinais as the price of his neutrality in a family struggle over Anjou and thereby linked the royal possessions in Sens with those around Paris, Melun, and Orléans. His major efforts, however, were directed toward Normandy, in which from 1076 he supported Robert II Curthose, its ineffectual duke, first against Robert’s father, King William I of England, then against Robert’s brother, William II. Philip’s true goal was to prevent emergence of a rival power in Normandy, for he was willing to abandon Robert whenever it seemed possible he might become dangerous. Because of his firm determination to retain control over all appointments to ecclesiastical posts, which he blatantly sold, Philip was eventually drawn into conflict with the papacy, which nonetheless did not assume the disastrous proportions of the similar struggle over investitures in the Holy Roman Empire. This conflict was exacerbated by his matrimonial affairs; his scandalous “marriage” with Bertrada de Montfort, wife of a vassal, brought him repeated excommunication. By 1107, when the French monarchy’s struggle with the papacy was finally ended, Louis VI, Philip’s son by his legitimate wife, Bertha, had taken over the administration of the kingdom, Philip having been rendered inactive by his extreme obesity.",
      "images" : [
        "https://media1.britannica.com/eb-media/52/132752-004-37C125A5.jpg",
        "https://s3-us-west-2.amazonaws.com/find-a-grave-prod/photos/2011/56/53676134_129873752075.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Philippe1France.JPG/220px-Philippe1France.JPG",
        "http://freepages.genealogy.rootsweb.ancestry.com/~chatweb/philipi2.jpg"
      ]
    },
    {
      "id" : 15,
      "desc" : "Louis VI, byname Louis the Fat, French Louis le Gros (born 1081—died Aug. 1, 1137), king of France from 1108 to 1137; he brought power and dignity to the French crown by his recovery of royal authority over the independent nobles in his domains of the Île-de-France and the Orléanais. Louis was designated by his father, Philip I, as his successor in 1098 and was already effectively the ruler well before Philip’s death in 1108. He quickly recognized that his priority must be to bring the unruly barons of the royal lands under firm control, and he spent much of his reign in conflict with such men as Hugh de Puiset. His success won him the respect of his greater vassals and was crucial to later Capetian expansion. From his pacification program Louis developed several important concepts for future kings: for example, that the king was a vassal of no man. Louis usually had a good relationship with the church and clergy. He has been presented by some historians as the father of communes or towns, but in fact he recognized towns only out of circumstance rather than from principle.Louis’s major wars were against King Henry I of England during the periods 1104–13 and 1116–20. When Charles the Good, count of Flanders, was assassinated in 1127, Louis supported William Clito, who became the successor; even though William was eventually toppled, Louis’s actions demonstrated the new strength of the monarchy. In 1124 he was able to muster forces from many parts of France to counter a threatened invasion by the Holy Roman emperor Henry V, identifying himself as the vassal of St. Denis, the patron saint of France, whose banner he carried. Louis’s last major achievement was to arrange a marriage between his son Louis VII and Eleanor, heiress of William X, duke of Aquitaine. Abbot Suger of Saint-Denis, a most trusted adviser, is the primary historian for Louis’s reign.",
      "images" : [
        "https://media1.britannica.com/eb-media/98/133398-004-F23EE8FC.jpg",
        "https://s-media-cache-ak0.pinimg.com/originals/ee/21/68/ee2168970db3f7e30d7ec6a6075cbc64.jpg",
        "http://www.claude.dupras.com/louisVI_legros.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Sceau_de_Louis_VI.jpg/1200px-Sceau_de_Louis_VI.jpg"
      ]
    },
    {
      "id" : 16,
      "desc" : "Louis VII, byname Louis The Younger, French Louis Le Jeune (born c. 1120—died Sept. 18, 1180, Paris), Capetian king of France who pursued a long rivalry, marked by recurrent warfare and continuous intrigue, with Henry II of England. In 1131 Louis was anointed as successor to his father, Louis VI, and in 1137 he became the sole ruler at his father’s death. Louis married Eleanor, daughter of William X, duke of Aquitaine, in 1137, a few days before his effective rule began, and he thus temporarily extended the Capetian lands to the Pyrenees. Louis continued his father’s pacification program by building the prestige of the kingship through an administrative government based on trustworthy men of humble origin and by consolidating his rule over his royal domains rather than by adding new acquisitions. From 1141 to 1143 he was involved in a fruitless conflict with Count Thibaut of Champagne and the papacy. But thereafter his relations with the popes were good; Alexander II, whom he supported against Frederick Barbarossa, took refuge in France. But the major threat to his reign came from Geoffrey, count of Anjou and, briefly, of Normandy, and Geoffrey’s son Henry, who later (1154) became King Henry II of England as well as ruler of both Anjou and Normandy. After Louis repudiated his wife Eleanor for misconduct on March 21, 1152, she married Henry, who then took over control of Aquitaine. Ironically, this act was probably to Capetian advantage because Aquitaine might have drained the resources of Louis’s kingdom while bringing him little revenue. After the death of Louis’s second wife, he married Alix of Champagne, whose Carolingian blood brought added prestige to the monarchy (1160); their son became Philip II Augustus.",
      "images" : [
        "https://media1.britannica.com/eb-media/99/133399-004-230B2B59.jpg",
        "https://s-media-cache-ak0.pinimg.com/originals/47/1b/b1/471bb12eeb90079b51956bae21f620db.jpg",
        "http://skepticism-images.s3-website-us-east-1.amazonaws.com/images/jreviews/Louis-VII-Engraving.jpg",
        "https://s-media-cache-ak0.pinimg.com/originals/7d/3f/94/7d3f947f1e23dd49b21627a09f785945.jpg"
      ]
    }
  ]
}